var classroom_data = [{
    type: "西校区",
    room_groups: {
        0: [
            ["教学一楼"],
            ["教室", "座位", "方位"],
            ["1 教", "80", "前楼一层西"],
            ["2 教", "116", "前楼一层西"],
            ["3 教", "116", "前楼一层东"],
            ["4 教", "80", "前楼一层东"],
            ["5 教", "60", "后楼一层西"],
            ["6 教", "60", "后楼一层西"],
            ["7 教", "60", "后楼一层西"],
            ["8 教", "60", "后楼一层东"],
            ["9 教", "60", "后楼一层东"],
            ["10 教", "60", "后楼一层东"],
            ["11 教", "64", "前楼二层西"],
            ["12 教", "116", "前楼二层西"],
            ["13 教", "116", "前楼二层东"],
            ["14 教", "80", "前楼二层东"],
            ["15 教", "60", "后楼二层西"],
            ["16 教", "60", "后楼二层西"],
            ["17 教", "60", "后楼二层西"],
            ["18 教", "60", "后楼二层西"],
            ["19 教", "60", "后楼二层东"],
            ["20 教", "60", "后楼二层东"],
            ["21 教", "60", "后楼二层东"],
            ["22 教", "60", "后楼二层东"],
            ["23 教", "60", "后楼三层西"],
            ["24 教", "60", "后楼三层西"],
            ["25 教", "60", "后楼三层西"],
            ["26 教", "60", "后楼三层西"]
        ],
        1: [
            ["教学一楼"],
            ["教室", "座位", "方位"],
            ["27 教", "60", "后楼三层东"],
            ["28 教", "60", "后楼三层东"],
            ["29 教", "60", "后楼三层东"],
            ["30 教", "60", "后楼三层东"],
            ["教学二楼(原药系楼)"],
            ["46 教", "144", "三层东南"],
            ["47 教", "136", "四层东南"],
            ["48 教", "144", "四层西南"],
            ["49 教", "144", "二层东南"],
            ["教学三楼(原科研楼)"],
            ["32 教", "32", "一层西南"],
            ["33 教", "128", "一层西南"],
            ["34 教", "144", "二层西南"],
            ["35 教", "144", "二层西北"],
            ["36 教", "144", "三层西南"],
            ["37 教", "144", "三层西北"],
            ["38 教", "144", "四层西南"],
            ["39 教", "128", "一层东南"],
            ["40 教", "32", "一层东南"],
            ["41 教", "32", "一层东北"],
            ["42 教", "128", "一层东北"],
            ["43 教", "144", "四层东北"],
            ["50 教", "144", "三层东南"],
            ["51 教", "144", "三层东北"],
            ["52 教", "144", "四层西北"]
        ]
    }
}, {
    type: "西校区",
    room_groups: {
        0: [
            ["教学六楼（人文学院楼）"],
            ["教室", "座位", "方位(原药厂)"],
            ["53 教", "70", "一层南侧"],
            ["54 教", "70", "一层北侧"],
            ["55 教", "70", "一层南侧"],
            ["56 教", "70", "一层北侧"],
            ["57 教", "70", "一层南侧"],
            ["58 教", "80", "一层北侧"],
            ["59 教", "80", "一层南侧"],
            ["65 教", "24", "一层南侧"],
            ["66 教", "32", "一层南侧"],
            ["67 教", "92", "二层西侧"]
        ],
        1: [
            ["西平房教室(原药厂)"],
            ["教室", "座位", "方位"],
            ["60 教", "100", "院内左侧"],
            ["61 教", "108", "院内左侧"],
            ["62 教", "100", "院内左侧"],
            ["63 教", "100", "院内左侧"],
            ["64 教", "108", "院内左侧"],
            ["基础医学院楼"],
            ["44 教", "100", "一层西南"],
            ["45 教", "100", "一层西南"]
        ]
    }
}, {
    type: "东校区",
    room_groups: {
        0: [
            ["教室", "座位", "方位"],
            ["2 教", "62", "护理楼二层"],
            ["6 教", "46", "护理楼二层"],
            ["7 教", "46", "护理楼二层"],
            ["8 教", "46", "护理楼二层"],
            ["9 教", "168", "护理楼一层"],
            ["10 教", "128", "教学楼一层"],
            ["11 教", "128", "教学楼一层"],
            ["12 教", "128", "教学楼二层"],
            ["13 教", "128", "教学楼二层"],
            ["1号学生公寓"],
            ["14 教", "87", "公寓一层"],
            ["15 教", "87", "公寓一层"],
            ["16 教", "87", "公寓一层"]
        ],
        1: [
            ["教室", "座位", "方位"],
            ["17 教", "87", "公寓一层"],
            ["18 教", "59", "公寓一层"],
            ["19 教", "59", "公寓一层"],
            ["20 教", "59", "公寓一层"],
            ["21 教", "59", "公寓一层"],
            ["2号学生公寓"],
            ["22 教", "78", "公寓一层"],
            ["23 教", "87", "公寓一层"],
            ["24 教", "87", "公寓一层"],
            ["25 教", "87", "公寓一层"],
            ["26 教", "87", "公寓一层"],
            ["27 教", "87", "公寓一层"]
        ]
    }
}, {
    type: "计算机机房、语音室",
    room_groups: {
        0: [
            ["机房"],
            ["教室", "座位", "方位"],
            ["机房 1", "38", "教学一楼后楼四层东"],
            ["机房 2", "52", "教学一楼后楼四层西"],
            ["机房 3", "38", "教学一楼后楼四层东"],
            ["机房 4", "60", "教学一楼后楼五层东"],
            ["机房 5", "66", "药系楼一层东"],
            ["机房 6", "66", "药系楼三层东"],
            ["东区机房", "70", "东区图书馆三层"]
        ],
        1: [
            ["语音室"],
            ["教室", "座位", "方位"],
            ["403", "45", "教学一楼后楼四层西"],
            ["602", "69", "教学一楼后楼六层西"],
            ["东区语音室 1", "60", "东区图书馆三层"],
            ["东区语音室 2", "48", "东区中药楼三层"]
        ]
    }
}]
